{
  "jobs": [

    {
      "id": "Embedded-engineer",
      "title": "Embedded Engineer",
      "department": "Engineering",
      "location": "Noida",
      "type": "Permanent Job",
      "postedDate": "2025-04-25",
      "shortDescription": "Develop OpenBMC firmware and server manageability features with a focus on ARM and x86 platforms.",
      "description": "We’re looking for an experienced Embedded Engineer to lead firmware development for our server platforms. You’ll work on OpenBMC solutions, performance monitoring tools, and system manageability features using industry standards like Redfish and PLDM.",
      "responsibilities": [
      "Create and deploy OpenBMC firmware with emphasis on Arm architecture.",
      "Configure BMC firmware, analyze performance, and implement server manageability features.",
      "Develop diagnostic, error, and configuration modules for components like CPU, GPU, DIMM, SSD, NICs, IB, PSU, BMC, FPGA, and CPLD.",
      "Design BMC solutions using DMTF standards such as MCTP, Redfish, SPDM, and PLDM.",
      "Write and automate unit tests for all modules and maintain test coverage reports.",
      "Generate software quality reports using metrics like CPU load and static analysis.",
      "Collaborate with hardware teams and review architecture/schematics to influence design."
      ],
      "requirements": [
      "5+ years of experience in electronics engineering or computer science.",
      "Hands-on experience in firmware development for x86 or ARM platforms.",
      "Board bring-up and driver-level expertise (SPI, PCIe, SMBus, I2C/I3C).",
      "Strong understanding of BIOS communication, power management, firmware updates, and device security.",
      "Experience in system management (IPMI, KCS, PMBus, NVMe) and DMTF standards (PLDM, Redfish, etc.).",
      "Proficiency in C/C++ for Linux system programming and scripting.",
      "Solid grasp of Linux build systems, packaging, and upgrade flows."
      ],
      "preferred": [
      "Understanding of REST APIs, JSON over HTTPS, and OAuth authentication.",
      "Experience influencing hardware design through firmware development.",
      "Strong code review and unit testing discipline.",
      "Excellent oral and written communication and collaboration skills.",
      "Proactive attitude toward high-quality deliverables and deadlines."
      ],
          "salary": "Negotiable",
      "applicationEmail": "recruit@afrost.org"
    },

    {
      "id": "automation-tester",
      "title": "Automation Tester",
      "department": "Engineering",
      "location": "Remote",
      "type": "Full-time",
      "postedDate": "2025-04-22",
      "shortDescription": "Ensure the reliability and performance of our applications through automation testing using Playwright, JMeter, and API tools.",
      "description": "We are seeking a skilled Automation Tester with expertise in Playwright, JMeter, and API testing to ensure the reliability, performance, and security of our product. The ideal candidate will have experience in automation testing of UI and RESTful APIs, along with a strong understanding of Kubernetes and cloud infrastructure.",
      "responsibilities": [
        "Design, develop, and maintain automated test cases for UI and API testing across functional, integration, regression, and performance scenarios.",
        "Utilize tools such as Playwright, Selenium, Postman, Rest Assured, and JMeter to create comprehensive automation test suites.",
        "Validate UI workflows, layouts, and interactions against business and user experience requirements.",
        "Perform API validations including request/response structures, status codes, error handling, and data integrity.",
        "Automate test cases using frameworks like JUnit, TestNG, or Playwright, in conjunction with Selenium or REST-assured.",
        "Identify, document, and track bugs through issue-tracking tools, collaborating with developers to ensure timely resolution.",
        "Work closely with developers, QA, DevOps, and business analysts to validate application behavior and troubleshoot defects.",
        "Execute automated tests in containerized environments (e.g., Kubernetes), ensuring stability and scalability.",
        "Conduct basic performance testing using tools like JMeter to assess API and UI response times under load.",
        "Stay current with trends in UI and API automation and best practices."
      ],
      "requirements": [
        "Strong understanding of web application architecture and RESTful APIs.",
        "Hands-on experience with UI automation tools like Playwright or Selenium.",
        "Proficient in API testing using Postman, Rest Assured, or SoapUI.",
        "Solid knowledge of HTML, CSS, JavaScript, JSON, XML, HTTP methods, and status codes.",
        "Programming experience in Java, Python, or JavaScript for test automation.",
        "Familiarity with CI/CD tools such as Jenkins, Git, and Docker.",
        "Experience testing in containerized environments with working knowledge of Kubernetes (K8s).",
        "Exposure to performance testing tools like JMeter or Locust, with ability to analyze metrics.",
        "Understanding of cloud-native platforms and modern application infrastructures."
      ],
      "preferred": [
        "Exposure to cloud environments like AWS, Azure, or GCP.",
        "Experience with OpenShift and advanced Kubernetes setups."
      ],
      "salary": "Negotiable",
      "applicationEmail": "recruit@afrost.org"
    }
    
  ]
}