{
  "jobs": [

    {
      "id": "Embedded-engineer",
      "title": "Embedded Engineer",
      "department": "Engineering",
      "location": "Noida",
      "type": "Permanent Job",
      "postedDate": "2025-04-25",
      "shortDescription": "Develop OpenBMC firmware and server manageability features with a focus on ARM and x86 platforms.",
      "description": "We’re looking for an experienced Embedded Engineer to lead firmware development for our server platforms. You’ll work on OpenBMC solutions, performance monitoring tools, and system manageability features using industry standards like Redfish and PLDM.",
      "responsibilities": [
      "Create and deploy OpenBMC firmware with emphasis on Arm architecture.",
      "Configure BMC firmware, analyze performance, and implement server manageability features.",
      "Develop diagnostic, error, and configuration modules for components like CPU, GPU, DIMM, SSD, NICs, IB, PSU, BMC, FPGA, and CPLD.",
      "Design BMC solutions using DMTF standards such as MCTP, Redfish, SPDM, and PLDM.",
      "Write and automate unit tests for all modules and maintain test coverage reports.",
      "Generate software quality reports using metrics like CPU load and static analysis.",
      "Collaborate with hardware teams and review architecture/schematics to influence design."
      ],
      "requirements": [
      "5+ years of experience in electronics engineering or computer science.",
      "Hands-on experience in firmware development for x86 or ARM platforms.",
      "Board bring-up and driver-level expertise (SPI, PCIe, SMBus, I2C/I3C).",
      "Strong understanding of BIOS communication, power management, firmware updates, and device security.",
      "Experience in system management (IPMI, KCS, PMBus, NVMe) and DMTF standards (PLDM, Redfish, etc.).",
      "Proficiency in C/C++ for Linux system programming and scripting.",
      "Solid grasp of Linux build systems, packaging, and upgrade flows."
      ],
      "preferred": [
      "Understanding of REST APIs, JSON over HTTPS, and OAuth authentication.",
      "Experience influencing hardware design through firmware development.",
      "Strong code review and unit testing discipline.",
      "Excellent oral and written communication and collaboration skills.",
      "Proactive attitude toward high-quality deliverables and deadlines."
      ],
          "salary": "Negotiable",
      "applicationEmail": "recruit@afrost.org"
    },

    {
      "id": "automation-tester",
      "title": "Automation Tester",
      "department": "Engineering",
      "location": "Noida",
      "type": "Permanent Job",
      "postedDate": "2025-04-22",
      "shortDescription": "Ensure the reliability and performance of our applications through automation testing using Playwright, JMeter, and API tools.",
      "description": "We are seeking a skilled Automation Tester with expertise in Playwright, JMeter, and API testing to ensure the reliability, performance, and security of our product. The ideal candidate will have experience in automation testing of UI and RESTful APIs, along with a strong understanding of Kubernetes and cloud infrastructure.",
      "responsibilities": [
        "Design, develop, and maintain automated test cases for UI and API testing across functional, integration, regression, and performance scenarios.",
        "Utilize tools such as Playwright, Selenium, Postman, Rest Assured, and JMeter to create comprehensive automation test suites.",
        "Validate UI workflows, layouts, and interactions against business and user experience requirements.",
        "Perform API validations including request/response structures, status codes, error handling, and data integrity.",
        "Automate test cases using frameworks like JUnit, TestNG, or Playwright, in conjunction with Selenium or REST-assured.",
        "Identify, document, and track bugs through issue-tracking tools, collaborating with developers to ensure timely resolution.",
        "Work closely with developers, QA, DevOps, and business analysts to validate application behavior and troubleshoot defects.",
        "Execute automated tests in containerized environments (e.g., Kubernetes), ensuring stability and scalability.",
        "Conduct basic performance testing using tools like JMeter to assess API and UI response times under load.",
        "Stay current with trends in UI and API automation and best practices."
      ],
      "requirements": [
        "Strong understanding of web application architecture and RESTful APIs.",
        "Hands-on experience with UI automation tools like Playwright or Selenium.",
        "Proficient in API testing using Postman, Rest Assured, or SoapUI.",
        "Solid knowledge of HTML, CSS, JavaScript, JSON, XML, HTTP methods, and status codes.",
        "Programming experience in Java, Python, or JavaScript for test automation.",
        "Familiarity with CI/CD tools such as Jenkins, Git, and Docker.",
        "Experience testing in containerized environments with working knowledge of Kubernetes (K8s).",
        "Exposure to performance testing tools like JMeter or Locust, with ability to analyze metrics.",
        "Understanding of cloud-native platforms and modern application infrastructures."
      ],
      "preferred": [
        "Exposure to cloud environments like AWS, Azure, or GCP.",
        "Experience with OpenShift and advanced Kubernetes setups."
      ],
      "salary": "Negotiable",
      "applicationEmail": "recruit@afrost.org"
    },
    {
      "id": "SDE-2-python",
      "title": "Software Developer Engineer - 2",
      "department": "Software Development",
      "location": "Noida",
      "type": "Permanent Job",
      "postedDate": "2025-04-25",
      "shortDescription": "Join our engineering team to develop scalable, high-performance server-side applications using Python or Golang.",
      "description": "As a Software Engineer at , you will help develop our next-generation cloud native core solution, contributing to our product and open-source community vision. The role requires writing scalable Python code and building robust, low-latency server-side logic.",
      "responsibilities": [
        "System engineering and implementation in Python or Golang.",
        "Tackle performance issues using internal tools and creative experimentation.",
        "Integrate relevant open-source projects aligned with product goals.",
        "Write clean, efficient, well-documented Python/Golang code.",
        "Engage in product definition, design, implementation, testing, and deployment.",
        "Discuss abstract system architecture and solve technical challenges.",
        "Mentor junior engineers and promote a culture of trust and ownership."
      ],
      "requirements": [
        "Minimum 3 years of experience in Python development.",
        "Strong Python skills with hands-on experience in reusable frameworks.",
        "Experience with design-driven development, CI, and highly scalable systems.",
        "Understanding of Kubernetes architecture and standard APIs.",
        "Contribution to CNCF or other open-source communities is a plus.",
        "Experience in performance benchmarking and cloud-native technologies."
      ],
      "preferred": [
        "Background in building cost-optimized, high-performance software.",
        "Experience with application security and functional programming.",
        "Ability to influence hardware design from a software perspective."
      ],
      "salary": "Negotiable",
      "applicationEmail": "recruit@afrost.org"
    },
    {
      "id": "Technical-lead",
      "title": "Technical Lead",
      "department": "Software Development",
      "location": "India",
      "type": "Permanent Job",
      "postedDate": "2025-04-25",
      "shortDescription": "Lead engineering efforts on cloud-native and hyper-scale platforms while mentoring a growing team.",
      "description": "As a Technical Lead , you’ll be responsible for guiding the technical vision and development of our next-generation cloud-native products. You’ll work closely with the team on system architecture, framework development, and open-source integration while leading by example.",
      "responsibilities": [
        "System engineering and implementation in Python/Golang/Java/ReactJS.",
        "Resolve performance issues through creative experimentation and in-house tools.",
        "Propose and integrate open-source projects based on product goals.",
        "Write clean, well-documented Python code for mentoring purposes.",
        "Oversee all phases of product lifecycle: design, implementation, testing, and deployment.",
        "Discuss system architectures and apply domain expertise to technical problems.",
        "Lead and mentor software engineers and promote a collaborative culture.",
        "Contribute to REST API development and optimization."
      ],
      "requirements": [
        "Bachelor’s or Master’s in Computer Science or related field.",
        "8+ years of software development experience.",
        "Proficiency with Python/Golang and reusable framework design.",
        "Experience with microservices architecture and OpenStack is a plus.",
        "Solid knowledge of networking and Kubernetes.",
        "Familiarity with design patterns, code refactoring, CI/CD, and scalable app development."
      ],
      "preferred": [
        "Cloud-native mindset and experience in problem-solving real-time systems.",
        "Experience working with cloud and telecom product stacks.",
        "Strong mentorship and team-building capabilities."
      ],
      "salary": "Negotiable",
      "applicationEmail": "recruit@afrost.org"
    },
    {
      "id": "technical-writer",
      "title": "Technical Writer",
      "department": "Software Development",
      "location": "Noida",
      "type": "Permanent Job",
      "postedDate": "2025-04-24",
      "shortDescription": "Translate complex technical information into clear, user-friendly content.",
      "description": "As a Technical Writer , you will create and maintain documentation such as user guides, API docs, release notes, and white papers. You’ll work closely with cross-functional teams to ensure content accuracy and accessibility.",
      "responsibilities": [
        "Write and maintain user guides, FAQs, and API documentation.",
        "Collaborate with engineers, designers, and product teams for technical input.",
        "Translate technical concepts for both technical and non-technical users.",
        "Improve existing documentation through user feedback and testing."
      ],
      "requirements": [
        "2+ years of technical writing experience.",
        "Strong understanding of RESTful APIs, Markdown, Git, and Confluence.",
        "Excellent communication skills and attention to detail.",
        "Familiarity with cloud platforms and Kubernetes is a plus."
      ],
      "preferred": [
        "Experience with content strategy and CMS platforms.",
        "Knowledge of OpenStack, OpenShift, and multi-cloud environments."
      ],
      "salary": "Negotiable",
      "applicationEmail": "recruit@afrost.org"
    },
    {
      "id": "project-manager-tpm",
      "title": "Technical Program Manager",
      "department": "Software Development",
      "location": "India",
      "type": "Permanent Job",
      "postedDate": "2025-04-24",
      "shortDescription": "Lead OpenStack cloud deployments and ensure cross-functional delivery.",
      "description": "We’re hiring a TPM to manage cloud projects focused on OpenStack and Kubernetes. You will coordinate engineering, product, and vendor stakeholders, ensuring timely and successful project execution.",
      "responsibilities": [
        "Manage cloud deployment projects and timelines.",
        "Coordinate cross-functional teams and vendor partners.",
        "Oversee OpenStack provisioning and CI/CD pipelines.",
        "Implement Agile and DevOps best practices across teams."
      ],
      "requirements": [
        "5–7 years of project management experience.",
        "Strong knowledge of OpenStack, Kubernetes, and cloud infra.",
        "Hands-on with Jira, Agile/Scrum practices, and CI/CD tooling.",
        "Excellent communication and risk management skills."
      ],
      "preferred": [
        "Certifications like PMP, PRINCE2, or CSM.",
        "Experience managing enterprise cloud rollouts."
      ],
      "salary": "Negotiable",
      "applicationEmail": "recruit@afrost.org"
    },
    {
      "id": "vp-of-engineering",
      "title": "VP of Engineering",
      "department": "Software Development",
      "location": "India",
      "type": "Permanent Job",
      "postedDate": "2025-04-24",
      "shortDescription": "Lead engineering and DevOps teams to build sovereign cloud and GPU-based platforms.",
      "description": "We’re seeking a VP of Engineering to drive technical vision for our sovereign cloud and GPU-as-a-service platform. You'll lead distributed engineering teams and define scalable strategies for compute, networking, and DevSecOps.",
      "responsibilities": [
        "Define and execute technical strategy for sovereign cloud.",
        "Architect scalable GPU compute infrastructure and orchestration.",
        "Lead engineering, DevOps, and SRE teams across regions.",
        "Ensure regulatory compliance, CI/CD, and performance optimization."
      ],
      "requirements": [
        "14+ years of experience in cloud or distributed systems.",
        "Deep knowledge of Kubernetes, Go, Python, and DevSecOps.",
        "Experience with GPU workloads, SDN, and cloud security.",
        "Strong leadership in scaling cloud-native teams."
      ],
      "preferred": [
        "Experience in sovereign/hyperscale cloud environments.",
        "Expertise in Prometheus, Grafana, and infrastructure automation."
      ],
      "salary": "Negotiable",
      "applicationEmail": "recruit@afrost.org"
    },
    {
      "id": "Gen AI Engineer",
      "title": "Gen AI  Engineer",
      "department": "Advanced Enginnering Services",
      "location": "India",
      "type": "Permanent Job",
      "postedDate": "2025-07-25",
      "shortDescription": "Full Stack Technical lead with Management skills in Python , Generative AI",
      "description": "We are seeking a hands-on Full Stack Web Technical Lead with strong technical management skills to lead and guide development teams in delivering high-quality web applications. This role requires deep expertise in cloud-native architecture, full-stack web development, and hands-on coding, particularly in Python. The ideal candidate will drive estimations, task breakdowns, code reviews, and guide the team to successfully deliver projects. In addition, the role involves leading small-scale POCs, contributing to the technical roadmap, and staying at the forefront of Generative AI application development.",
      "responsibilities": [
        "Lead and mentor a team of full-stack developers, providing technical guidance throughout the development lifecycle",
        "Drive task estimation and planning, creating detailed work breakdown structures",
        "Conduct peer reviews of code, ensuring high quality, performance, and security standards",
        "Foster a collaborative and innovative team environment",
        "Build and maintain cloud-native applications using Python, React, and modern frameworks",
        "Deploy applications on cloud platforms using Docker and Kubernetes",
        "Design scalable and secure architectures for web application stacks",
        "Lead cloud-native architecture design and development",
        "Integrate cloud-native services and microservices architectures",
        "Lead small-scale POCs for new technologies and Generative AI applications",
        "Develop web applications leveraging Generative AI and AI models",
        "Stay current with AI trends and implement innovative solutions",
        "Own end-to-end web application delivery from design to deployment",
        "Drive agile development processes and best practices",
        "Implement CI/CD pipelines and testing automation"
      ],
      "requirements": [
        "8+ years of experience in full-stack web development, with at least 2 years in a technical lead role",
        "Proficiency in Python and experience in building backend services using frameworks such as Django, Flask, or FastAPI",
        "Strong expertise in front-end development with frameworks like React, Angular, or Vue.js",
        "Solid understanding of databases (SQL/NoSQL) and integration of back-end services with front-end interfaces",
        "Experience with cloud-native architecture, designing and deploying applications on AWS, Azure, or Google Cloud",
        "Experience with Kubernetes, Docker, serverless, and microservices architectures",
        "Deep understanding of full-stack web development from front-end to backend, and cloud infrastructure",
        "Practical experience in developing applications that leverage Generative AI technologies and AI/ML models",
        "Strong experience in leading teams using Agile methodologies, driving continuous delivery and improvement",
        "Proven leadership abilities with strong communication and mentoring skills",
        "Demonstrated problem-solving abilities with focus on scalable, reliable solutions",
        "Bachelor's or Master's degree in Computer Science, Engineering, or related field"
      ],
      "preferred": [
        "Experience with AI frameworks such as TensorFlow, PyTorch, or Hugging Face",
        "Familiarity with Generative AI models and their application in web development",
        "Experience in building and deploying AI-driven applications",
        "Knowledge of DevOps practices and tools for CI/CD pipelines",
        "Experience with performance optimization and security best practices in web applications"
        ],
      "salary": "Negotiable",
      "applicationEmail": "recruit@afrost.org"
    }




  ]
}



